#### Terraform Format and Style 🖌 `failure`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.VEBERArnaud.data.github_user.main: Refreshing state...
module.BRENOTPierre.data.github_user.main: Refreshing state...
module.codelabs.github_repository.main: Refreshing state... [id=codelabs]
module.FEIREISENBenjamin.data.github_user.main: Refreshing state...
module.typescript-boilerplates.github_repository.main: Refreshing state... [id=typescript-boilerplates]
module.trainings.github_repository.main: Refreshing state... [id=trainings]
module.wheel-of-fortune.github_repository.main: Refreshing state... [id=wheel-of-fortune]
module.BERNARDJeremy.data.github_user.main: Refreshing state...
module.DUNGKevin.data.github_user.main: Refreshing state...
module.ANDREAlexandre.data.github_user.main: Refreshing state...
module.developers.github_team.main: Refreshing state... [id=642624]
module.MOUTTEAnthony.data.github_user.main: Refreshing state...
module.LENGLETMartin.data.github_user.main: Refreshing state...
module.api-validator.github_repository.main: Refreshing state... [id=api-validator]
module.jekyll-multiple-languages-plugin.github_repository.main: Refreshing state... [id=jekyll-multiple-languages-plugin]
module.eslint-config.github_repository.main: Refreshing state... [id=eslint-config]
module.BESSOUDOSebastien.data.github_user.main: Refreshing state...
module.eleven-labs_com.github_repository.main: Refreshing state... [id=eleven-labs.com]
module.MOATIJacques.data.github_user.main: Refreshing state...
module.amp-jekyll.github_repository.main: Refreshing state... [id=amp-jekyll]
module.nebula_react.github_repository.main: Refreshing state... [id=nebula-react]
module.core.github_team.main: Refreshing state... [id=540795]
module.GRAILLONRobin.data.github_user.main: Refreshing state...
module.hq.github_team.main: Refreshing state... [id=2362575]
module.desksharing.github_repository.main: Refreshing state... [id=desksharing]
module.github.github_repository.main: Refreshing state... [id=github]
module.KANIANoel.data.github_user.main: Refreshing state...
module.MIGEOTDEBARANFabrice.data.github_user.main: Refreshing state...
module.SAILLARDDamien11.data.github_user.main: Refreshing state...
module.RAMEAUBenoit.data.github_user.main: Refreshing state...
module.FERTDimitri.data.github_user.main: Refreshing state...
module.SAILLARDDamien.data.github_user.main: Refreshing state...
module.AMARAAntoine.data.github_user.main: Refreshing state...
module.REGAIBIIlyace.data.github_user.main: Refreshing state...
module.BOUCQUETOTYann.data.github_user.main: Refreshing state...
module.DEMELLIERRomain.data.github_user.main: Refreshing state...
module.AMARBenjamin.data.github_user.main: Refreshing state...
module.WILSON.data.github_user.main: Refreshing state...
module.MINASYANMarie.data.github_user.main: Refreshing state...
module.CANALGuillem.data.github_user.main: Refreshing state...
module.LOVERGNEClement.data.github_user.main: Refreshing state...
module.COURBORenaud.data.github_user.main: Refreshing state...
module.KONTOMARKOSSophie.data.github_user.main: Refreshing state...
module.GREVINNicolas.data.github_user.main: Refreshing state...
module.CORDIERKevin.data.github_user.main: Refreshing state...
module.BERTHETJeanBaptiste.data.github_user.main: Refreshing state...
module.BETHMONTThomas.data.github_user.main: Refreshing state...
module.CLAVIERAnais.data.github_user.main: Refreshing state...
module.MULEZIGuillaume.data.github_user.main: Refreshing state...
module.PIERRELOUISMatthieu.data.github_user.main: Refreshing state...
module.POINTURIERLucas.data.github_user.main: Refreshing state...
module.XUAlexandre.data.github_user.main: Refreshing state...
module.DJERRAHSamira.data.github_user.main: Refreshing state...
module.GHERBIYamin.data.github_user.main: Refreshing state...
module.CHARDENALMatthieu.data.github_user.main: Refreshing state...
module.PEAUDECERFMarion.data.github_user.main: Refreshing state...
module.OUNALLIMarwa.data.github_user.main: Refreshing state...
module.black_hole.github_repository.main: Refreshing state... [id=black-hole]
module.FRUITDimitri.data.github_user.main: Refreshing state...
module.LEROUGEPierre.data.github_user.main: Refreshing state...
module.LANAUGregory.data.github_user.main: Refreshing state...
module.ALLIERAlexandre.data.github_user.main: Refreshing state...
module.CHARRONMaeva.data.github_user.main: Refreshing state...
module.JACQUEMINArthur.data.github_user.main: Refreshing state...
module.DEBANDTJulien.data.github_user.main: Refreshing state...
module.THIBAULTGuillaume.data.github_user.main: Refreshing state...
module.CIEPKAJeanBaptiste.data.github_user.main: Refreshing state...
module.PASQUETFabien.data.github_user.main: Refreshing state...
module.NICOLAIEAlexandre.data.github_user.main: Refreshing state...
module.MAVILLAZRemi.data.github_user.main: Refreshing state...
module.BELETFabiola.data.github_user.main: Refreshing state...
module.DUVALDavid.data.github_user.main: Refreshing state...
module.DELPEYROUXVictor.data.github_user.main: Refreshing state...
module.TRAPANIMariaEugenia.data.github_user.main: Refreshing state...
module.PEJOUTThomas.data.github_user.main: Refreshing state...
module.CADOUXMartin.data.github_user.main: Refreshing state...
module.LALOUMMichael.data.github_user.main: Refreshing state...
module.JOSEPHMarianne.data.github_user.main: Refreshing state...
module.FLORANTLoris.data.github_user.main: Refreshing state...
module.GORRONCharlesEric.data.github_user.main: Refreshing state...
module.SOLOMEmmanuel.data.github_user.main: Refreshing state...
module.LABIEDHKaies.data.github_user.main: Refreshing state...
module.JARDINETRemy.data.github_user.main: Refreshing state...
module.DIOURIYounes.data.github_user.main: Refreshing state...
module.SURPierre.data.github_user.main: Refreshing state...
module.THUONThierry.data.github_user.main: Refreshing state...
module.BOILLONYannick.data.github_user.main: Refreshing state...
module.NAULINThomas.data.github_user.main: Refreshing state...
module.EINHORNStephane.data.github_user.main: Refreshing state...
module.BERRYElsa.data.github_user.main: Refreshing state...
module.blog_eleven-labs_com.github_repository.main: Refreshing state... [id=blog.eleven-labs.com]
module.trainings.github_issue_label.main[7]: Refreshing state... [id=trainings:type/question]
module.trainings.github_issue_label.main[1]: Refreshing state... [id=trainings:status/mergeable]
module.trainings.github_issue_label.main[3]: Refreshing state... [id=trainings:status/wip]
module.trainings.github_issue_label.main[6]: Refreshing state... [id=trainings:type/fix]
module.trainings.github_issue_label.main[8]: Refreshing state... [id=trainings:type/refactor]
module.trainings.github_issue_label.main[0]: Refreshing state... [id=trainings:status/depend]
module.trainings.github_issue_label.main[9]: Refreshing state... [id=trainings:type/test]
module.trainings.github_issue_label.main[2]: Refreshing state... [id=trainings:status/reviewable]
module.trainings.github_issue_label.main[4]: Refreshing state... [id=trainings:type/chore]
module.trainings.github_issue_label.main[5]: Refreshing state... [id=trainings:type/feat]
module.codelabs.github_issue_label.main[2]: Refreshing state... [id=codelabs:status/reviewable]
module.codelabs.github_repository_webhook.main[0]: Refreshing state... [id=77131724]
module.codelabs.github_repository_webhook.main[1]: Refreshing state... [id=253136607]
module.codelabs.github_issue_label.main[1]: Refreshing state... [id=codelabs:status/mergeable]
module.codelabs.github_issue_label.main[5]: Refreshing state... [id=codelabs:type/feat]
module.codelabs.github_issue_label.main[4]: Refreshing state... [id=codelabs:type/chore]
module.codelabs.github_issue_label.main[8]: Refreshing state... [id=codelabs:type/refactor]
module.codelabs.github_issue_label.main[7]: Refreshing state... [id=codelabs:type/question]
module.codelabs.github_issue_label.main[0]: Refreshing state... [id=codelabs:status/depend]
module.codelabs.github_issue_label.main[6]: Refreshing state... [id=codelabs:type/fix]
module.codelabs.github_issue_label.main[3]: Refreshing state... [id=codelabs:status/wip]
module.codelabs.github_issue_label.main[9]: Refreshing state... [id=codelabs:type/test]
module.typescript-boilerplates.github_issue_label.main[2]: Refreshing state... [id=typescript-boilerplates:status/reviewable]
module.typescript-boilerplates.github_issue_label.main[6]: Refreshing state... [id=typescript-boilerplates:type/fix]
module.typescript-boilerplates.github_issue_label.main[1]: Refreshing state... [id=typescript-boilerplates:status/mergeable]
module.typescript-boilerplates.github_issue_label.main[4]: Refreshing state... [id=typescript-boilerplates:type/chore]
module.typescript-boilerplates.github_issue_label.main[5]: Refreshing state... [id=typescript-boilerplates:type/feat]
module.typescript-boilerplates.github_issue_label.main[3]: Refreshing state... [id=typescript-boilerplates:status/wip]
module.typescript-boilerplates.github_issue_label.main[9]: Refreshing state... [id=typescript-boilerplates:type/test]
module.typescript-boilerplates.github_issue_label.main[0]: Refreshing state... [id=typescript-boilerplates:status/depend]
module.typescript-boilerplates.github_issue_label.main[7]: Refreshing state... [id=typescript-boilerplates:type/question]
module.typescript-boilerplates.github_issue_label.main[8]: Refreshing state... [id=typescript-boilerplates:type/refactor]
module.wheel-of-fortune.github_issue_label.main[0]: Refreshing state... [id=wheel-of-fortune:status/depend]
module.wheel-of-fortune.github_issue_label.main[3]: Refreshing state... [id=wheel-of-fortune:status/wip]
module.wheel-of-fortune.github_issue_label.main[5]: Refreshing state... [id=wheel-of-fortune:type/feat]
module.wheel-of-fortune.github_issue_label.main[7]: Refreshing state... [id=wheel-of-fortune:type/question]
module.wheel-of-fortune.github_issue_label.main[1]: Refreshing state... [id=wheel-of-fortune:status/mergeable]
module.wheel-of-fortune.github_issue_label.main[2]: Refreshing state... [id=wheel-of-fortune:status/reviewable]
module.wheel-of-fortune.github_issue_label.main[4]: Refreshing state... [id=wheel-of-fortune:type/chore]
module.wheel-of-fortune.github_issue_label.main[9]: Refreshing state... [id=wheel-of-fortune:type/test]
module.wheel-of-fortune.github_issue_label.main[8]: Refreshing state... [id=wheel-of-fortune:type/refactor]
module.wheel-of-fortune.github_issue_label.main[6]: Refreshing state... [id=wheel-of-fortune:type/fix]
module.FEIREISENBenjamin.github_membership.main: Refreshing state... [id=eleven-labs:bfeir-eleven]
module.api-validator.github_issue_label.main[8]: Refreshing state... [id=api-validator:type/refactor]
module.api-validator.github_issue_label.main[3]: Refreshing state... [id=api-validator:status/wip]
module.api-validator.github_issue_label.main[9]: Refreshing state... [id=api-validator:type/test]
module.api-validator.github_issue_label.main[0]: Refreshing state... [id=api-validator:status/depend]
module.api-validator.github_issue_label.main[5]: Refreshing state... [id=api-validator:type/feat]
module.api-validator.github_issue_label.main[7]: Refreshing state... [id=api-validator:type/question]
module.api-validator.github_issue_label.main[4]: Refreshing state... [id=api-validator:type/chore]
module.api-validator.github_issue_label.main[2]: Refreshing state... [id=api-validator:status/reviewable]
module.api-validator.github_issue_label.main[6]: Refreshing state... [id=api-validator:type/fix]
module.api-validator.github_repository_webhook.main[0]: Refreshing state... [id=61952561]
module.api-validator.github_repository_webhook.main[1]: Refreshing state... [id=61898918]
module.api-validator.github_repository_webhook.main[2]: Refreshing state... [id=294754360]
module.api-validator.github_issue_label.main[1]: Refreshing state... [id=api-validator:status/mergeable]
module.VEBERArnaud.github_membership.main: Refreshing state... [id=eleven-labs:VEBERArnaud]
module.jekyll-multiple-languages-plugin.github_issue_label.main[0]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/depend]
module.jekyll-multiple-languages-plugin.github_issue_label.main[1]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/mergeable]
module.jekyll-multiple-languages-plugin.github_issue_label.main[8]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/refactor]
module.jekyll-multiple-languages-plugin.github_issue_label.main[5]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/feat]
module.jekyll-multiple-languages-plugin.github_issue_label.main[9]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/test]
module.jekyll-multiple-languages-plugin.github_issue_label.main[4]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/chore]
module.jekyll-multiple-languages-plugin.github_issue_label.main[3]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/wip]
module.jekyll-multiple-languages-plugin.github_issue_label.main[7]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/question]
module.jekyll-multiple-languages-plugin.github_issue_label.main[2]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/reviewable]
module.jekyll-multiple-languages-plugin.github_issue_label.main[6]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/fix]
module.BRENOTPierre.github_membership.main: Refreshing state... [id=eleven-labs:flipper-ananas]
module.eslint-config.github_issue_label.main[9]: Refreshing state... [id=eslint-config:type/test]
module.eslint-config.github_issue_label.main[3]: Refreshing state... [id=eslint-config:status/wip]
module.eslint-config.github_issue_label.main[8]: Refreshing state... [id=eslint-config:type/refactor]
module.eslint-config.github_issue_label.main[2]: Refreshing state... [id=eslint-config:status/reviewable]
module.eslint-config.github_issue_label.main[1]: Refreshing state... [id=eslint-config:status/mergeable]
module.eslint-config.github_issue_label.main[6]: Refreshing state... [id=eslint-config:type/fix]
module.eslint-config.github_issue_label.main[7]: Refreshing state... [id=eslint-config:type/question]
module.eslint-config.github_issue_label.main[0]: Refreshing state... [id=eslint-config:status/depend]
module.eslint-config.github_issue_label.main[4]: Refreshing state... [id=eslint-config:type/chore]
module.eslint-config.github_issue_label.main[5]: Refreshing state... [id=eslint-config:type/feat]
module.DUNGKevin.github_membership.main: Refreshing state... [id=eleven-labs:KevinDung]
module.BERNARDJeremy.github_membership.main: Refreshing state... [id=eleven-labs:BernardJeremy]
module.ANDREAlexandre.github_membership.main: Refreshing state... [id=eleven-labs:alex-ception]
module.eleven-labs_com.github_issue_label.main[9]: Refreshing state... [id=eleven-labs.com:type/test]
module.eleven-labs_com.github_issue_label.main[4]: Refreshing state... [id=eleven-labs.com:type/chore]
module.eleven-labs_com.github_issue_label.main[2]: Refreshing state... [id=eleven-labs.com:status/reviewable]
module.eleven-labs_com.github_issue_label.main[7]: Refreshing state... [id=eleven-labs.com:type/question]
module.eleven-labs_com.github_issue_label.main[8]: Refreshing state... [id=eleven-labs.com:type/refactor]
module.eleven-labs_com.github_issue_label.main[3]: Refreshing state... [id=eleven-labs.com:status/wip]
module.eleven-labs_com.github_issue_label.main[5]: Refreshing state... [id=eleven-labs.com:type/feat]
module.eleven-labs_com.github_issue_label.main[6]: Refreshing state... [id=eleven-labs.com:type/fix]
module.eleven-labs_com.github_issue_label.main[0]: Refreshing state... [id=eleven-labs.com:status/depend]
module.eleven-labs_com.github_issue_label.main[1]: Refreshing state... [id=eleven-labs.com:status/mergeable]
module.amp-jekyll.github_issue_label.main[1]: Refreshing state... [id=amp-jekyll:status/mergeable]
module.amp-jekyll.github_issue_label.main[7]: Refreshing state... [id=amp-jekyll:type/question]
module.amp-jekyll.github_issue_label.main[4]: Refreshing state... [id=amp-jekyll:type/chore]
module.amp-jekyll.github_issue_label.main[0]: Refreshing state... [id=amp-jekyll:status/depend]
module.amp-jekyll.github_issue_label.main[9]: Refreshing state... [id=amp-jekyll:type/test]
module.amp-jekyll.github_issue_label.main[6]: Refreshing state... [id=amp-jekyll:type/fix]
module.amp-jekyll.github_issue_label.main[5]: Refreshing state... [id=amp-jekyll:type/feat]
module.amp-jekyll.github_issue_label.main[2]: Refreshing state... [id=amp-jekyll:status/reviewable]
module.amp-jekyll.github_issue_label.main[3]: Refreshing state... [id=amp-jekyll:status/wip]
module.amp-jekyll.github_issue_label.main[8]: Refreshing state... [id=amp-jekyll:type/refactor]
module.MOUTTEAnthony.github_membership.main: Refreshing state... [id=eleven-labs:instabledesign]
module.nebula_react.github_issue_label.main[1]: Refreshing state... [id=nebula-react:status/mergeable]
module.nebula_react.github_issue_label.main[6]: Refreshing state... [id=nebula-react:type/fix]
module.nebula_react.github_issue_label.main[8]: Refreshing state... [id=nebula-react:type/refactor]
module.nebula_react.github_issue_label.main[3]: Refreshing state... [id=nebula-react:status/wip]
module.nebula_react.github_issue_label.main[4]: Refreshing state... [id=nebula-react:type/chore]
module.nebula_react.github_issue_label.main[0]: Refreshing state... [id=nebula-react:status/depend]
module.nebula_react.github_issue_label.main[7]: Refreshing state... [id=nebula-react:type/question]
module.nebula_react.github_issue_label.main[5]: Refreshing state... [id=nebula-react:type/feat]
module.nebula_react.github_issue_label.main[9]: Refreshing state... [id=nebula-react:type/test]
module.nebula_react.github_issue_label.main[2]: Refreshing state... [id=nebula-react:status/reviewable]
module.LENGLETMartin.github_membership.main: Refreshing state... [id=eleven-labs:ulrik59]
module.desksharing.github_issue_label.main[6]: Refreshing state... [id=desksharing:type/fix]
module.desksharing.github_issue_label.main[3]: Refreshing state... [id=desksharing:status/wip]
module.desksharing.github_issue_label.main[1]: Refreshing state... [id=desksharing:status/mergeable]
module.desksharing.github_issue_label.main[2]: Refreshing state... [id=desksharing:status/reviewable]
module.desksharing.github_issue_label.main[5]: Refreshing state... [id=desksharing:type/feat]
module.desksharing.github_issue_label.main[7]: Refreshing state... [id=desksharing:type/question]
module.desksharing.github_issue_label.main[0]: Refreshing state... [id=desksharing:status/depend]
module.desksharing.github_issue_label.main[4]: Refreshing state... [id=desksharing:type/chore]
module.desksharing.github_issue_label.main[8]: Refreshing state... [id=desksharing:type/refactor]
module.desksharing.github_issue_label.main[9]: Refreshing state... [id=desksharing:type/test]
module.github.github_issue_label.main[6]: Refreshing state... [id=github:type/fix]
module.github.github_branch_protection.main[0]: Refreshing state... [id=github:master]
module.github.github_issue_label.main[5]: Refreshing state... [id=github:type/feat]
module.github.github_issue_label.main[8]: Refreshing state... [id=github:type/refactor]
module.github.github_issue_label.main[4]: Refreshing state... [id=github:type/chore]
module.github.github_issue_label.main[7]: Refreshing state... [id=github:type/question]
module.github.github_issue_label.main[0]: Refreshing state... [id=github:status/depend]
module.github.github_issue_label.main[3]: Refreshing state... [id=github:status/wip]
module.github.github_issue_label.main[9]: Refreshing state... [id=github:type/test]
module.github.github_issue_label.main[1]: Refreshing state... [id=github:status/mergeable]
module.github.github_issue_label.main[2]: Refreshing state... [id=github:status/reviewable]
module.BESSOUDOSebastien.github_membership.main: Refreshing state... [id=eleven-labs:Sbessoudo]
module.MOATIJacques.github_membership.main: Refreshing state... [id=eleven-labs:Jmoati]
module.GRAILLONRobin.github_membership.main: Refreshing state... [id=eleven-labs:graillus]
module.KANIANoel.github_membership.main: Refreshing state... [id=eleven-labs:snroki]
module.MIGEOTDEBARANFabrice.github_membership.main: Refreshing state... [id=eleven-labs:nmss]
module.SAILLARDDamien11.github_membership.main: Refreshing state... [id=eleven-labs:dsaillard-eleven-labs]
module.RAMEAUBenoit.github_membership.main: Refreshing state... [id=eleven-labs:captain-Krook]
module.FERTDimitri.github_membership.main: Refreshing state... [id=eleven-labs:dimitri-fert]
module.SAILLARDDamien.github_membership.main: Refreshing state... [id=eleven-labs:daemon1981]
module.AMARAAntoine.github_membership.main: Refreshing state... [id=eleven-labs:antoine-amara]
module.REGAIBIIlyace.github_membership.main: Refreshing state... [id=eleven-labs:RedHotMan]
module.BOUCQUETOTYann.github_membership.main: Refreshing state... [id=eleven-labs:YannBqt]
module.DEMELLIERRomain.github_membership.main: Refreshing state... [id=eleven-labs:RomainDemellier]
module.AMARBenjamin.github_membership.main: Refreshing state... [id=eleven-labs:BenAmarEleven]
module.WILSON.github_membership.main: Refreshing state... [id=eleven-labs:ElevenWilson]
module.MINASYANMarie.github_membership.main: Refreshing state... [id=eleven-labs:MarieMinasyan]
module.CANALGuillem.github_membership.main: Refreshing state... [id=eleven-labs:guillemcanal]
module.LOVERGNEClement.github_membership.main: Refreshing state... [id=eleven-labs:loverg-c]
module.COURBORenaud.github_membership.main: Refreshing state... [id=eleven-labs:rcourbo87]
module.KONTOMARKOSSophie.github_membership.main: Refreshing state... [id=eleven-labs:breizh81]
module.GREVINNicolas.github_membership.main: Refreshing state... [id=eleven-labs:nicolas-grevin]
module.CORDIERKevin.github_membership.main: Refreshing state... [id=eleven-labs:frisoty]
module.BERTHETJeanBaptiste.github_membership.main: Refreshing state... [id=eleven-labs:jb-berthet]
module.BETHMONTThomas.github_membership.main: Refreshing state... [id=eleven-labs:thomasbethmont]
module.CLAVIERAnais.github_membership.main: Refreshing state... [id=eleven-labs:Anacla]
module.MULEZIGuillaume.github_membership.main: Refreshing state... [id=eleven-labs:TheMindset]
module.PIERRELOUISMatthieu.github_membership.main: Refreshing state... [id=eleven-labs:M2G]
module.POINTURIERLucas.github_membership.main: Refreshing state... [id=eleven-labs:pointu-l]
module.XUAlexandre.github_membership.main: Refreshing state... [id=eleven-labs:Banane95]
module.DJERRAHSamira.github_membership.main: Refreshing state... [id=eleven-labs:SamiraDjerrah]
module.black_hole.github_issue_label.main[1]: Refreshing state... [id=black-hole:status/mergeable]
module.black_hole.github_issue_label.main[9]: Refreshing state... [id=black-hole:type/test]
module.black_hole.github_issue_label.main[0]: Refreshing state... [id=black-hole:status/depend]
module.black_hole.github_issue_label.main[4]: Refreshing state... [id=black-hole:type/chore]
module.black_hole.github_issue_label.main[8]: Refreshing state... [id=black-hole:type/refactor]
module.black_hole.github_issue_label.main[6]: Refreshing state... [id=black-hole:type/fix]
module.black_hole.github_issue_label.main[5]: Refreshing state... [id=black-hole:type/feat]
module.black_hole.github_issue_label.main[7]: Refreshing state... [id=black-hole:type/question]
module.black_hole.github_issue_label.main[2]: Refreshing state... [id=black-hole:status/reviewable]
module.black_hole.github_issue_label.main[3]: Refreshing state... [id=black-hole:status/wip]
module.GHERBIYamin.github_membership.main: Refreshing state... [id=eleven-labs:YAMIN350]
module.CHARDENALMatthieu.github_membership.main: Refreshing state... [id=eleven-labs:Shad-Z]
module.PEAUDECERFMarion.github_membership.main: Refreshing state... [id=eleven-labs:MarionPdcf]
module.OUNALLIMarwa.github_membership.main: Refreshing state... [id=eleven-labs:marwaounalli]
module.FRUITDimitri.github_membership.main: Refreshing state... [id=eleven-labs:DimitriMorgan]
module.LEROUGEPierre.github_membership.main: Refreshing state... [id=eleven-labs:RedPi]
module.LANAUGregory.github_membership.main: Refreshing state... [id=eleven-labs:glanau]
module.ALLIERAlexandre.github_membership.main: Refreshing state... [id=eleven-labs:aallier]
module.CHARRONMaeva.github_membership.main: Refreshing state... [id=eleven-labs:mcharron11labs]
module.JACQUEMINArthur.github_membership.main: Refreshing state... [id=eleven-labs:ArthurJCQ]
module.DEBANDTJulien.github_membership.main: Refreshing state... [id=eleven-labs:Juliendbandt]
module.THIBAULTGuillaume.github_membership.main: Refreshing state... [id=eleven-labs:gthibault2]
module.CIEPKAJeanBaptiste.github_membership.main: Refreshing state... [id=eleven-labs:jbcfrance]
module.PASQUETFabien.github_membership.main: Refreshing state... [id=eleven-labs:fpasquet]
module.NICOLAIEAlexandre.github_membership.main: Refreshing state... [id=eleven-labs:xunleii]
module.MAVILLAZRemi.github_membership.main: Refreshing state... [id=eleven-labs:KizeRemi]
module.BELETFabiola.github_membership.main: Refreshing state... [id=eleven-labs:DevFabi]
module.DUVALDavid.github_membership.main: Refreshing state... [id=eleven-labs:duvaldavid60]
module.DELPEYROUXVictor.github_membership.main: Refreshing state... [id=eleven-labs:Vik-Th0r]
module.TRAPANIMariaEugenia.github_membership.main: Refreshing state... [id=eleven-labs:meugeniatr]
module.PEJOUTThomas.github_membership.main: Refreshing state... [id=eleven-labs:ElevenTom]
module.CADOUXMartin.github_membership.main: Refreshing state... [id=eleven-labs:martincadoux]
module.LALOUMMichael.github_membership.main: Refreshing state... [id=eleven-labs:Maykii11]
module.JOSEPHMarianne.github_membership.main: Refreshing state... [id=eleven-labs:ElevenMarianne]
module.FLORANTLoris.github_membership.main: Refreshing state... [id=eleven-labs:lorisco]
module.GORRONCharlesEric.github_membership.main: Refreshing state... [id=eleven-labs:ch3ric]
module.SOLOMEmmanuel.github_membership.main: Refreshing state... [id=eleven-labs:manuEleven]
module.LABIEDHKaies.github_membership.main: Refreshing state... [id=eleven-labs:kais2503]
module.JARDINETRemy.github_membership.main: Refreshing state... [id=eleven-labs:Pouzor]
module.DIOURIYounes.github_membership.main: Refreshing state... [id=eleven-labs:younesdiouri]
module.SURPierre.github_membership.main: Refreshing state... [id=eleven-labs:psur-eleven]
module.blog_eleven-labs_com.github_issue_label.main[8]: Refreshing state... [id=blog.eleven-labs.com:type/refactor]
module.blog_eleven-labs_com.github_issue_label.main[9]: Refreshing state... [id=blog.eleven-labs.com:type/test]
module.blog_eleven-labs_com.github_issue_label.main[2]: Refreshing state... [id=blog.eleven-labs.com:status/reviewable]
module.blog_eleven-labs_com.github_issue_label.main[3]: Refreshing state... [id=blog.eleven-labs.com:status/wip]
module.blog_eleven-labs_com.github_issue_label.main[6]: Refreshing state... [id=blog.eleven-labs.com:type/fix]
module.blog_eleven-labs_com.github_issue_label.main[0]: Refreshing state... [id=blog.eleven-labs.com:status/depend]
module.blog_eleven-labs_com.github_issue_label.main[4]: Refreshing state... [id=blog.eleven-labs.com:type/chore]
module.blog_eleven-labs_com.github_issue_label.main[1]: Refreshing state... [id=blog.eleven-labs.com:status/mergeable]
module.blog_eleven-labs_com.github_issue_label.main[5]: Refreshing state... [id=blog.eleven-labs.com:type/feat]
module.blog_eleven-labs_com.github_issue_label.main[7]: Refreshing state... [id=blog.eleven-labs.com:type/question]
module.THUONThierry.github_membership.main: Refreshing state... [id=eleven-labs:lepiaf]
module.BOILLONYannick.github_membership.main: Refreshing state... [id=eleven-labs:yannickBoillon]
module.NAULINThomas.github_membership.main: Refreshing state... [id=eleven-labs:ThomasNaulin]
module.EINHORNStephane.github_membership.main: Refreshing state... [id=eleven-labs:seinhorn]
module.BERRYElsa.github_membership.main: Refreshing state... [id=eleven-labs:ElsaEleven]
module.blog_eleven-labs_com.github_branch_protection.main[0]: Refreshing state... [id=blog.eleven-labs.com:master]
module.codelabs.github_branch_protection.main[0]: Refreshing state... [id=codelabs:master]
module.core.github_team_membership.members["VEBERArnaud"]: Refreshing state... [id=540795:VEBERArnaud]
module.core.github_team_membership.members["graillus"]: Refreshing state... [id=540795:graillus]
module.core.github_team_membership.members["Pouzor"]: Refreshing state... [id=540795:Pouzor]
module.core.github_team_membership.members["daemon1981"]: Refreshing state... [id=540795:daemon1981]
module.core.github_team_membership.members["ch3ric"]: Refreshing state... [id=540795:ch3ric]
module.core.github_team_membership.members["fpasquet"]: Refreshing state... [id=540795:fpasquet]
module.core.github_team_membership.members["dsaillard-eleven-labs"]: Refreshing state... [id=540795:dsaillard-eleven-labs]
module.core.github_team_membership.members["snroki"]: Refreshing state... [id=540795:snroki]
module.hq.github_team_repository.repositories["nebula-react"]: Refreshing state... [id=2362575:nebula-react]
module.hq.github_team_repository.repositories["trainings"]: Refreshing state... [id=2362575:trainings]
module.hq.github_team_repository.repositories["blog.eleven-labs.com"]: Refreshing state... [id=2362575:blog.eleven-labs.com]
module.hq.github_team_repository.repositories["jekyll-multiple-languages-plugin"]: Refreshing state... [id=2362575:jekyll-multiple-languages-plugin]
module.hq.github_team_repository.repositories["black-hole"]: Refreshing state... [id=2362575:black-hole]
module.hq.github_team_repository.repositories["desksharing"]: Refreshing state... [id=2362575:desksharing]
module.hq.github_team_repository.repositories["api-validator"]: Refreshing state... [id=2362575:api-validator]
module.hq.github_team_repository.repositories["amp-jekyll"]: Refreshing state... [id=2362575:amp-jekyll]
module.hq.github_team_repository.repositories["wheel-of-fortune"]: Refreshing state... [id=2362575:wheel-of-fortune]
module.hq.github_team_repository.repositories["typescript-boilerplates"]: Refreshing state... [id=2362575:typescript-boilerplates]
module.hq.github_team_repository.repositories["github"]: Refreshing state... [id=2362575:github]
module.hq.github_team_repository.repositories["eleven-labs.com"]: Refreshing state... [id=2362575:eleven-labs.com]
module.developers.github_team_repository.repositories["desksharing"]: Refreshing state... [id=642624:desksharing]
module.developers.github_team_repository.repositories["github"]: Refreshing state... [id=642624:github]
module.developers.github_team_repository.repositories["wheel-of-fortune"]: Refreshing state... [id=642624:wheel-of-fortune]
module.developers.github_team_repository.repositories["eleven-labs.com"]: Refreshing state... [id=642624:eleven-labs.com]
module.developers.github_team_repository.repositories["blog.eleven-labs.com"]: Refreshing state... [id=642624:blog.eleven-labs.com]
module.developers.github_team_repository.repositories["codelabs"]: Refreshing state... [id=642624:codelabs]
module.developers.github_team_repository.repositories["eslint-config"]: Refreshing state... [id=642624:eslint-config]
module.developers.github_team_repository.repositories["typescript-boilerplates"]: Refreshing state... [id=642624:typescript-boilerplates]
module.developers.github_team_repository.repositories["black-hole"]: Refreshing state... [id=642624:black-hole]
module.developers.github_team_repository.repositories["jekyll-multiple-languages-plugin"]: Refreshing state... [id=642624:jekyll-multiple-languages-plugin]
module.developers.github_team_repository.repositories["trainings"]: Refreshing state... [id=642624:trainings]
module.developers.github_team_repository.repositories["nebula-react"]: Refreshing state... [id=642624:nebula-react]
module.developers.github_team_repository.repositories["amp-jekyll"]: Refreshing state... [id=642624:amp-jekyll]
module.developers.github_team_repository.repositories["api-validator"]: Refreshing state... [id=642624:api-validator]
module.core.github_team_repository.repositories["desksharing"]: Refreshing state... [id=540795:desksharing]
module.hq.github_team_repository.repositories["eslint-config"]: Refreshing state... [id=2362575:eslint-config]
module.hq.github_team_repository.repositories["codelabs"]: Refreshing state... [id=2362575:codelabs]
module.core.github_team_repository.repositories["wheel-of-fortune"]: Refreshing state... [id=540795:wheel-of-fortune]
module.core.github_team_repository.repositories["eslint-config"]: Refreshing state... [id=540795:eslint-config]
module.core.github_team_repository.repositories["trainings"]: Refreshing state... [id=540795:trainings]
module.core.github_team_repository.repositories["jekyll-multiple-languages-plugin"]: Refreshing state... [id=540795:jekyll-multiple-languages-plugin]
module.core.github_team_repository.repositories["typescript-boilerplates"]: Refreshing state... [id=540795:typescript-boilerplates]
module.core.github_team_repository.repositories["github"]: Refreshing state... [id=540795:github]
module.core.github_team_repository.repositories["amp-jekyll"]: Refreshing state... [id=540795:amp-jekyll]
module.core.github_team_repository.repositories["codelabs"]: Refreshing state... [id=540795:codelabs]
module.core.github_team_repository.repositories["eleven-labs.com"]: Refreshing state... [id=540795:eleven-labs.com]
module.core.github_team_repository.repositories["api-validator"]: Refreshing state... [id=540795:api-validator]
module.core.github_team_repository.repositories["nebula-react"]: Refreshing state... [id=540795:nebula-react]
module.core.github_team_repository.repositories["blog.eleven-labs.com"]: Refreshing state... [id=540795:blog.eleven-labs.com]
module.core.github_team_repository.repositories["black-hole"]: Refreshing state... [id=540795:black-hole]
module.developers.github_team_membership.members["nicolas-grevin"]: Refreshing state... [id=642624:nicolas-grevin]
module.hq.github_team_membership.members["Maykii11"]: Refreshing state... [id=2362575:Maykii11]
module.developers.github_team_membership.members["ulrik59"]: Refreshing state... [id=642624:ulrik59]
module.developers.github_team_membership.members["fpasquet"]: Refreshing state... [id=642624:fpasquet]
module.developers.github_team_membership.members["guillemcanal"]: Refreshing state... [id=642624:guillemcanal]
module.hq.github_team_membership.members["SamiraDjerrah"]: Refreshing state... [id=2362575:SamiraDjerrah]
module.developers.github_team_membership.members["ElevenMarianne"]: Refreshing state... [id=642624:ElevenMarianne]
module.developers.github_team_membership.members["antoine-amara"]: Refreshing state... [id=642624:antoine-amara]
module.hq.github_team_membership.members["Anacla"]: Refreshing state... [id=2362575:Anacla]
module.developers.github_team_membership.members["DevFabi"]: Refreshing state... [id=642624:DevFabi]
module.developers.github_team_membership.members["dimitri-fert"]: Refreshing state... [id=642624:dimitri-fert]
module.developers.github_team_membership.members["graillus"]: Refreshing state... [id=642624:graillus]
module.developers.github_team_membership.members["meugeniatr"]: Refreshing state... [id=642624:meugeniatr]
module.developers.github_team_membership.members["Pouzor"]: Refreshing state... [id=642624:Pouzor]
module.developers.github_team_membership.members["Jmoati"]: Refreshing state... [id=642624:Jmoati]
module.hq.github_team_membership.members["ElevenTom"]: Refreshing state... [id=2362575:ElevenTom]
module.hq.github_team_membership.members["ElevenWilson"]: Refreshing state... [id=2362575:ElevenWilson]
module.developers.github_team_membership.members["Banane95"]: Refreshing state... [id=642624:Banane95]
module.developers.github_team_membership.members["marwaounalli"]: Refreshing state... [id=642624:marwaounalli]
module.developers.github_team_membership.members["YannBqt"]: Refreshing state... [id=642624:YannBqt]
module.hq.github_team_membership.members["ElsaEleven"]: Refreshing state... [id=2362575:ElsaEleven]
module.developers.github_team_membership.members["Vik-Th0r"]: Refreshing state... [id=642624:Vik-Th0r]
module.developers.github_team_membership.members["Shad-Z"]: Refreshing state... [id=642624:Shad-Z]
module.developers.github_team_membership.members["instabledesign"]: Refreshing state... [id=642624:instabledesign]
module.developers.github_team_membership.members["alex-ception"]: Refreshing state... [id=642624:alex-ception]
module.developers.github_team_membership.members["ArthurJCQ"]: Refreshing state... [id=642624:ArthurJCQ]
module.developers.github_team_membership.members["pointu-l"]: Refreshing state... [id=642624:pointu-l]
module.developers.github_team_membership.members["breizh81"]: Refreshing state... [id=642624:breizh81]
module.developers.github_team_membership.members["M2G"]: Refreshing state... [id=642624:M2G]
module.developers.github_team_membership.members["aallier"]: Refreshing state... [id=642624:aallier]
module.developers.github_team_membership.members["gthibault2"]: Refreshing state... [id=642624:gthibault2]
module.developers.github_team_membership.members["YAMIN350"]: Refreshing state... [id=642624:YAMIN350]
module.developers.github_team_membership.members["snroki"]: Refreshing state... [id=642624:snroki]
module.developers.github_team_membership.members["RedHotMan"]: Refreshing state... [id=642624:RedHotMan]
module.developers.github_team_membership.members["martincadoux"]: Refreshing state... [id=642624:martincadoux]
module.developers.github_team_membership.members["xunleii"]: Refreshing state... [id=642624:xunleii]
module.developers.github_team_membership.members["RedPi"]: Refreshing state... [id=642624:RedPi]
module.developers.github_team_membership.members["Juliendbandt"]: Refreshing state... [id=642624:Juliendbandt]
module.developers.github_team_membership.members["Sbessoudo"]: Refreshing state... [id=642624:Sbessoudo]
module.developers.github_team_membership.members["seinhorn"]: Refreshing state... [id=642624:seinhorn]
module.developers.github_team_membership.members["rcourbo87"]: Refreshing state... [id=642624:rcourbo87]
module.developers.github_team_membership.members["Anacla"]: Refreshing state... [id=642624:Anacla]
module.developers.github_team_membership.members["DimitriMorgan"]: Refreshing state... [id=642624:DimitriMorgan]
module.developers.github_team_membership.members["glanau"]: Refreshing state... [id=642624:glanau]
module.developers.github_team_membership.members["frisoty"]: Refreshing state... [id=642624:frisoty]
module.developers.github_team_membership.members["KevinDung"]: Refreshing state... [id=642624:KevinDung]
module.developers.github_team_membership.members["MarionPdcf"]: Refreshing state... [id=642624:MarionPdcf]
module.developers.github_team_membership.members["manuEleven"]: Refreshing state... [id=642624:manuEleven]
module.developers.github_team_membership.members["yannickBoillon"]: Refreshing state... [id=642624:yannickBoillon]
module.developers.github_team_membership.members["mcharron11labs"]: Refreshing state... [id=642624:mcharron11labs]
module.developers.github_team_membership.members["duvaldavid60"]: Refreshing state... [id=642624:duvaldavid60]
module.developers.github_team_membership.members["jb-berthet"]: Refreshing state... [id=642624:jb-berthet]
module.developers.github_team_membership.members["MarieMinasyan"]: Refreshing state... [id=642624:MarieMinasyan]
module.developers.github_team_membership.members["flipper-ananas"]: Refreshing state... [id=642624:flipper-ananas]
module.developers.github_team_membership.members["RomainDemellier"]: Refreshing state... [id=642624:RomainDemellier]
module.developers.github_team_membership.members["ThomasNaulin"]: Refreshing state... [id=642624:ThomasNaulin]
module.developers.github_team_membership.members["daemon1981"]: Refreshing state... [id=642624:daemon1981]
module.developers.github_team_membership.members["ch3ric"]: Refreshing state... [id=642624:ch3ric]
module.developers.github_team_membership.members["dsaillard-eleven-labs"]: Refreshing state... [id=642624:dsaillard-eleven-labs]
module.developers.github_team_membership.members["kais2503"]: Refreshing state... [id=642624:kais2503]
module.developers.github_team_membership.members["captain-Krook"]: Refreshing state... [id=642624:captain-Krook]
module.developers.github_team_membership.members["KizeRemi"]: Refreshing state... [id=642624:KizeRemi]
module.developers.github_team_membership.members["TheMindset"]: Refreshing state... [id=642624:TheMindset]
module.hq.github_team_membership.members["BenAmarEleven"]: Refreshing state... [id=2362575:BenAmarEleven]
module.developers.github_team_membership.members["lepiaf"]: Refreshing state... [id=642624:lepiaf]
module.developers.github_team_membership.members["nmss"]: Refreshing state... [id=642624:nmss]
module.developers.github_team_membership.members["younesdiouri"]: Refreshing state... [id=642624:younesdiouri]
module.developers.github_team_membership.members["VEBERArnaud"]: Refreshing state... [id=642624:VEBERArnaud]
module.developers.github_team_membership.members["loverg-c"]: Refreshing state... [id=642624:loverg-c]
module.developers.github_team_membership.members["thomasbethmont"]: Refreshing state... [id=642624:thomasbethmont]
module.developers.github_team_membership.members["BernardJeremy"]: Refreshing state... [id=642624:BernardJeremy]
module.developers.github_team_membership.members["lorisco"]: Refreshing state... [id=642624:lorisco]
module.developers.github_team_membership.members["psur-eleven"]: Refreshing state... [id=642624:psur-eleven]
module.developers.github_team_membership.members["bfeir-eleven"]: Refreshing state... [id=642624:bfeir-eleven]
module.developers.github_team_membership.members["jbcfrance"]: Refreshing state... [id=642624:jbcfrance]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.core.github_team_repository.repositories["design-system"] will be created
  + resource "github_team_repository" "repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "design-system"
      + team_id    = "540795"
    }

  # module.design-system.github_issue_label.main[0] will be created
  + resource "github_issue_label" "main" {
      + color       = "d93f0b"
      + description = "status: depend"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "status/depend"
      + repository  = "design-system"
      + url         = (known after apply)
    }

  # module.design-system.github_issue_label.main[1] will be created
  + resource "github_issue_label" "main" {
      + color       = "009800"
      + description = "status: mergeable"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "status/mergeable"
      + repository  = "design-system"
      + url         = (known after apply)
    }

  # module.design-system.github_issue_label.main[2] will be created
  + resource "github_issue_label" "main" {
      + color       = "1d76db"
      + description = "status: reviewable"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "status/reviewable"
      + repository  = "design-system"
      + url         = (known after apply)
    }

  # module.design-system.github_issue_label.main[3] will be created
  + resource "github_issue_label" "main" {
      + color       = "ffdd88"
      + description = "status: wip"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "status/wip"
      + repository  = "design-system"
      + url         = (known after apply)
    }

  # module.design-system.github_issue_label.main[4] will be created
  + resource "github_issue_label" "main" {
      + color       = "84b6eb"
      + description = "type: chore"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/chore"
      + repository  = "design-system"
      + url         = (known after apply)
    }

  # module.design-system.github_issue_label.main[5] will be created
  + resource "github_issue_label" "main" {
      + color       = "1abc9c"
      + description = "type: feat"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/feat"
      + repository  = "design-system"
      + url         = (known after apply)
    }

  # module.design-system.github_issue_label.main[6] will be created
  + resource "github_issue_label" "main" {
      + color       = "fbca04"
      + description = "type: fix"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/fix"
      + repository  = "design-system"
      + url         = (known after apply)
    }

  # module.design-system.github_issue_label.main[7] will be created
  + resource "github_issue_label" "main" {
      + color       = "c7def8"
      + description = "type: question"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/question"
      + repository  = "design-system"
      + url         = (known after apply)
    }

  # module.design-system.github_issue_label.main[8] will be created
  + resource "github_issue_label" "main" {
      + color       = "5319e7"
      + description = "type: refactor"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/refactor"
      + repository  = "design-system"
      + url         = (known after apply)
    }

  # module.design-system.github_issue_label.main[9] will be created
  + resource "github_issue_label" "main" {
      + color       = "cccccc"
      + description = "type: test"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/test"
      + repository  = "design-system"
      + url         = (known after apply)
    }

  # module.design-system.github_repository.main will be created
  + resource "github_repository" "main" {
      + allow_merge_commit = true
      + allow_rebase_merge = true
      + allow_squash_merge = true
      + archived           = false
      + auto_init          = false
      + default_branch     = (known after apply)
      + description        = "Eleven Labs - Design System"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_downloads      = true
      + has_issues         = true
      + has_projects       = true
      + has_wiki           = true
      + homepage_url       = "https://eleven-labs.github.io/design-system/"
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + name               = "design-system"
      + private            = false
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

  # module.developers.github_team_repository.repositories["design-system"] will be created
  + resource "github_team_repository" "repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "design-system"
      + team_id    = "642624"
    }

  # module.hq.github_team_repository.repositories["design-system"] will be created
  + resource "github_team_repository" "repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "design-system"
      + team_id    = "2362575"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @fpasquet, Action: `pull_request`, Workflow: `terraform`*